tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Essential tools
brew "neovim"
brew "git"
brew "zsh"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "lazygit"
brew "gh"
brew "starship"

# AI Tools
brew "convex"
cask "claude"

# Development
brew "node"
brew "bun"
brew "python"
brew "uv"
brew "go"
brew "rust"
brew "elixir"

# Database & Infrastructure
brew "postgresql@15"
brew "rabbitmq"
brew "awscli"

# Applications
cask "ghostty"
cask "visual-studio-code"
cask "docker"
cask "rectangle"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"